{"id":"Pepper__bell___Bacterial_spot#core","title":"Pepper — Bacterial spot","class":"Pepper__bell___Bacterial_spot","text":"Symptoms: small, water-soaked leaf spots that turn dark/brown with yellow halos; scabby raised lesions on fruit. Often worse after warm, wet, windy weather.\nScouting: inspect lower and mid canopy; look at both leaf surfaces and young fruit; check after rains/overhead irrigation.\nImmediate actions: remove badly infected leaves/fruit from the field (dispose, don’t compost); avoid working plants when wet; switch to drip if possible.\nIPM: rotate 2–3 seasons away from solanaceous crops; plant certified seed/seedlings; use resistant/tolerant varieties if available; sanitize tools; manage weeds; ensure good spacing and airflow.\nChemical (general): copper-based bactericides may help protect new growth when applied preventively; follow local labels and consult extension.\nWhen to escalate: rapid spread under wet weather; fruit losses rising—seek local extension advice."}
{"id":"Pepper__bell___healthy#core","title":"Pepper — Healthy crop care","class":"Pepper__bell___healthy","text":"Routine care: use certified seedlings; harden off before transplanting; maintain 30–45 cm plant spacing and 75–100 cm between rows for airflow.\nWater & nutrition: prefer drip; water early morning; soil test to guide N–P–K; avoid excess nitrogen that drives soft growth.\nSanitation: weed control; remove plant debris after harvest; disinfect tools.\nMonitoring: scout weekly for spots, wilting, sucking pests; record issues.\nPreventive IPM: mulch to reduce splash; rotate away from tomatoes/potatoes; stake where needed."}
{"id":"Potato___Early_blight#core","title":"Potato — Early blight","class":"Potato___Early_blight","text":"Symptoms: brown lesions with concentric target-like rings on older leaves; yellow halo; can cause defoliation and yield loss.\nScouting: start at lower canopy; check older leaves first; look after dry periods followed by humidity.\nImmediate actions: remove heavily infected foliage; ensure balanced nutrition (adequate K); avoid overhead irrigation in late day.\nIPM: rotate 2+ seasons; destroy volunteer potatoes; use certified seed; maintain spacing and hilling to keep tubers covered.\nChemical (general): protectant fungicides work best preventively and in a program; follow local guidance.\nWhen to escalate: lesions appearing on many plants/rapid defoliation."}
{"id":"Potato___healthy#core","title":"Potato — Healthy crop care","class":"Potato___healthy","text":"Routine care: plant certified, disease-free seed in well-drained soils; rotate 2–3 years; hill to prevent greening.\nWater & nutrition: regular, even moisture (avoid cycles of drought/flood); soil test; adequate K and Ca improve skin quality.\nSanitation: remove cull piles; control volunteers; clean equipment.\nMonitoring: scout weekly for leaf spots, wilts, aphids, late blight weather alerts."}
{"id":"Potato___Late_blight#core","title":"Potato — Late blight","class":"Potato___Late_blight","text":"Symptoms: water-soaked lesions on leaves/stems that rapidly expand; white fuzzy growth on undersides in humid conditions; tuber rot possible.\nScouting: check field edges and low spots first; inspect after cool, wet weather; look early morning.\nImmediate actions: remove/rogue hot spots (severely affected plants); avoid overhead irrigation; improve airflow.\nIPM: plant certified seed; destroy volunteers; tight rotation; avoid excess leaf wetness; choose tolerant varieties when available.\nChemical (general): fungicides are preventive; follow local spray advisories and labels.\nWhen to escalate: fast spread across rows, stem infections, or weather favors disease."}
{"id":"Tomato__Target_Spot#core","title":"Tomato — Target spot (Corynespora)","class":"Tomato__Target_Spot","text":"Symptoms: brown spots with concentric rings, often with yellow halos; can coalesce causing blight; fruit can show dark, sunken spots.\nScouting: inspect mid-to-lower canopy; after warm, humid nights; check both leaf surfaces.\nImmediate actions: remove heavily infected leaves; improve airflow; avoid leaf wetness late in the day.\nIPM: rotate 2–3 seasons; sanitize stakes/strings; balanced nutrition; resistant/tolerant cultivars if available.\nChemical (general): use protectant fungicides preventively during conducive weather; follow labels.\nWhen to escalate: lesions rapidly increasing; fruit symptoms appearing."}
{"id":"Tomato__Tomato_mosaic_virus#core","title":"Tomato — Tomato mosaic virus (ToMV)","class":"Tomato__Tomato_mosaic_virus","text":"Symptoms: light/dark green mosaic/mottling, leaf narrowing/shoestring, stunting; fruit may be small or malformed.\nScouting: look for patterned chlorosis rather than necrotic spots; check new growth.\nImmediate actions: rogue symptomatic plants to limit spread; wash hands, sanitize tools; avoid tobacco handling.\nIPM: use resistant cultivars; control seed/seedling sources; sanitize trays and tools; avoid mechanical transmission; manage greenhouse hygiene.\nWhen to escalate: many plants showing mosaic across blocks."}
{"id":"Tomato__Tomato_YellowLeaf__Curl_Virus#core","title":"Tomato — TYLCV (yellow leaf curl)","class":"Tomato__Tomato_YellowLeaf__Curl_Virus","text":"Symptoms: upward curling, yellowing of young leaves, stunting, reduced fruit set; transmitted by whiteflies.\nScouting: focus on new growth; monitor whitefly populations (undersides of leaves).\nImmediate actions: remove highly symptomatic plants; manage whiteflies (cultural controls, physical barriers, approved controls as per local guidance).\nIPM: use tolerant varieties and insect-exclusion nets where feasible; weed control; reflective mulches can deter vectors; avoid overlapping crops that harbor whiteflies.\nWhen to escalate: rapid spread and high vector counts."}
{"id":"Tomato_Bacterial_spot#core","title":"Tomato — Bacterial spot","class":"Tomato_Bacterial_spot","text":"Symptoms: small, dark leaf spots with yellow halos; fruit with raised, scabby lesions; defoliation in severe cases.\nScouting: check lower canopy and after storms; inspect fruit set stages.\nImmediate actions: remove infected foliage/fruit; avoid working plants when wet; switch to drip irrigation.\nIPM: resistant/tolerant cultivars; certified seed; sanitation; rotation 2–3 years; good airflow.\nChemical (general): copper-based products may help protect new growth; consult local guidance.\nWhen to escalate: fast spread during wet periods or fruit lesions increasing."}
{"id":"Tomato_Early_blight#core","title":"Tomato — Early blight","class":"Tomato_Early_blight","text":"Symptoms: brown spots with concentric rings (target-like) on older leaves; yellow halo; stem/fruit can be affected.\nScouting: inspect lower leaves first; look after humidity or rainfall.\nImmediate actions: remove blighted leaves; stake/prune to improve airflow; irrigate at soil level.\nIPM: rotate 2+ seasons; sanitize debris; balanced fertilization (avoid excess N, ensure K); resistant varieties when available.\nChemical (general): protectants work best preventively; follow labels.\nWhen to escalate: lesions expanding up the canopy or fruit infection starts."}
{"id":"Tomato_healthy#core","title":"Tomato — Healthy crop care","class":"Tomato_healthy","text":"Routine care: use certified seedlings and resistant cultivars; stake/trellis and prune to open canopy.\nWater & nutrition: drip irrigation preferred; water early day; soil test to guide fertilization; mulch to reduce splash.\nSanitation: remove lower leaves touching soil; clean tools; weed control.\nMonitoring: weekly scouting for spots, yellowing, wilts, mites/whiteflies; record and act early."}
{"id":"Tomato_Late_blight#core","title":"Tomato — Late blight","class":"Tomato_Late_blight","text":"Symptoms: water-soaked, rapidly expanding lesions on leaves/stems; white downy growth on undersides under humidity; fruit brown/firm lesions.\nScouting: monitor during cool, wet periods; check field edges and lower canopy early morning.\nImmediate actions: remove hot spots; avoid leaf wetness; increase airflow; destroy volunteer hosts.\nIPM: resistant/tolerant cultivars where available; rotation; sanitation; avoid overhead irrigation in evenings.\nChemical (general): fungicides are preventive/systemic depending on label; follow local advisories.\nWhen to escalate: spread across rows within days or stem infections observed."}
{"id":"Tomato_Leaf_Mold#core","title":"Tomato — Leaf mold (Passalora/Cladosporium)","class":"Tomato_Leaf_Mold","text":"Symptoms: pale/yellow spots on upper leaf and olive-green/gray velvety growth on underside; thrives in high humidity and poor airflow; usually not on fruit.\nScouting: inspect undersides of leaves in dense canopy/greenhouse.\nImmediate actions: improve ventilation; reduce humidity; remove infected leaves; water at soil level.\nIPM: wider spacing, pruning, sanitation; disinfect greenhouse surfaces; resistant cultivars if available.\nChemical (general): protectant fungicides can help when used early.\nWhen to escalate: persistent humidity and increasing leaf loss."}
{"id":"Tomato_Septoria_leaf_spot#core","title":"Tomato — Septoria leaf spot","class":"Tomato_Septoria_leaf_spot","text":"Symptoms: many small circular spots with dark margins and tan centers; tiny black dots (pycnidia) in centers; starts on lower leaves and moves up.\nScouting: check lower canopy weekly; after rains or overhead irrigation.\nImmediate actions: remove infected lower leaves; mulch soil; avoid splashing.\nIPM: rotate 2+ years; sanitize debris; stake/prune for airflow; drip irrigation.\nChemical (general): protectants used preventively can slow spread; follow labels.\nWhen to escalate: rapid upward movement and canopy thinning."}
{"id":"Tomato_Spider_mites_Two_spotted_spider_mite#core","title":"Tomato — Two-spotted spider mite","class":"Tomato_Spider_mites_Two_spotted_spider_mite","text":"Symptoms: fine stippling/yellow speckling on leaves, bronzing, webbing on undersides; hot/dry weather favors outbreaks.\nScouting: use hand lens on undersides; check field edges and dusty areas.\nImmediate actions: hose off leaves with water if feasible; remove heavily infested leaves; reduce plant stress.\nIPM: maintain humidity in greenhouse; avoid dusty conditions; conserve natural enemies; consider reflective mulch.\nChemical (general): use miticides only when thresholds are met and rotate modes of action per local guidance.\nWhen to escalate: webbing visible and leaves bronzing across plants."}
